# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}

#+latex: \newcommand{\mytitle}{Mais =for= para nós}
#+latex: \mytitleslide

* Configuração                                                     :noexport:

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
       '(("frame" "lines")
         ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |

* Comandos =for= aninhados 

#+begin_src C
for (/*lista de comandos*/; /*expressão lógica*/; /*lista de comandos*/) {
   // bloco de comandos
}
#+end_src
O ``bloco de comandos'' pode conter comandos =for=
- Todo o bloco é executado a cada iteração

#+latex: \pause

Vejamos o exemplo =a08-ka-ele.c=
#+BEGIN_SRC C :tangle e/a08-ka-ele.c
#include <stdio.h>
int main(){
  int ka, ele;
  for (ka = 1; ka <= 2; ka++)
    for (ele = 2; ele<=6; ele = ele + 2)
      printf("ka -> %d -- ele -> %d\n", ka, ele);
}
#+END_SRC

#+latex: {\scriptsize

#+begin_src shell :results output :exports both :dir e
gcc a08-ka-ele.c; ./a.out
#+end_src

#+RESULTS:
: ka -> 1 -- ele -> 2
: ka -> 1 -- ele -> 4
: ka -> 1 -- ele -> 6
: ka -> 2 -- ele -> 2
: ka -> 2 -- ele -> 4
: ka -> 2 -- ele -> 6

#+latex: }

* (#3 Maior-Menor) Uma solução possível com 4 números

=a08-maior-menor.c=
#+BEGIN_SRC C :tangle e/a08-maior-menor.c
#include <stdio.h>
#include <limits.h>
#define ELEM 4
int main (){
  int i, num, maior = INT_MIN, menor = INT_MAX;
    printf("No início: %d (menor), %d (maior)\n", menor, maior);
  for(i = 0; i < ELEM; i++){
    printf("Entre com o numero %d: ", i);
    scanf("%d", &num);
    if (num > maior) maior = num;
    if (num < menor) menor = num;
    printf("Iteração %d, até agora: %d (menor), %d (maior)\n", i, menor, maior);
  }
  printf("O menor numero eh %d, e o maior eh %d\n", menor, maior);
  return 0;
}
#+END_SRC

#+latex: \tiny\pause

#+begin_src shell :results output :exports both :dir e
gcc a08-maior-menor.c; echo "282 93912187 2 -12292" | ./a.out
#+end_src

#+RESULTS:
: No início: 2147483647 (menor), -2147483648 (maior)
: Entre com o numero 0: Iteração 0, até agora: 282 (menor), 282 (maior)
: Entre com o numero 1: Iteração 1, até agora: 282 (menor), 93912187 (maior)
: Entre com o numero 2: Iteração 2, até agora: 2 (menor), 93912187 (maior)
: Entre com o numero 3: Iteração 3, até agora: -12292 (menor), 93912187 (maior)
: O menor numero eh -12292, e o maior eh 93912187

* (#4 Série de potência) Compilação & Execução

#+latex: \tiny

#+begin_src shell :results output :dir e
gcc a08-serie-potencia.c -lm; echo "2 14" | ./a.out
#+end_src

#+RESULTS:
#+begin_example
Entre o valor x e o numero de termos da serie: 
Na iteração 0, valor 1.000000
Na iteração 1, valor 3.000000
Na iteração 2, valor 5.000000
Na iteração 3, valor 6.333333
Na iteração 4, valor 7.000000
Na iteração 5, valor 7.266667
Na iteração 6, valor 7.355556
Na iteração 7, valor 7.380952
Na iteração 8, valor 7.387302
Na iteração 9, valor 7.388713
Na iteração 10, valor 7.388995
Na iteração 11, valor 7.389046
Na iteração 12, valor 7.389055
Na iteração 13, valor 7.389056
Valor calculado : 7.389056
Valor de exp( 2): 7.389056
#+end_example

#+begin_src shell :results output :dir e
gcc a08-serie-potencia.c -lm; echo "3 6" | ./a.out
#+end_src

#+RESULTS:
: Entre o valor x e o numero de termos da serie: 
: Na iteração 0, valor 1.000000
: Na iteração 1, valor 4.000000
: Na iteração 2, valor 8.500000
: Na iteração 3, valor 13.000000
: Na iteração 4, valor 16.375000
: Na iteração 5, valor 18.400000
: Valor calculado : 18.400000
: Valor de exp( 3): 20.085537
